{"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "ragged": false, "name": "sex"}, "registered_name": null, "name": "sex", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "ragged": false, "name": "cp"}, "registered_name": null, "name": "cp", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "ragged": false, "name": "fbs"}, "registered_name": null, "name": "fbs", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "ragged": false, "name": "restecg"}, "registered_name": null, "name": "restecg", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "ragged": false, "name": "exang"}, "registered_name": null, "name": "exang", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "slope"}, "registered_name": null, "name": "slope", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "ragged": false, "name": "ca"}, "registered_name": null, "name": "ca", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "string", "sparse": false, "ragged": false, "name": "thal"}, "registered_name": null, "name": "thal", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "age"}, "registered_name": null, "name": "age", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "trestbps"}, "registered_name": null, "name": "trestbps", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "chol"}, "registered_name": null, "name": "chol", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "thalach"}, "registered_name": null, "name": "thalach", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "oldpeak"}, "registered_name": null, "name": "oldpeak", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "IntegerLookup", "config": {"name": "integer_lookup", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "invert": false, "max_tokens": null, "num_oov_indices": 1, "oov_token": -1, "mask_token": null, "output_mode": "multi_hot", "sparse": false, "pad_to_max_tokens": false, "vocabulary_dtype": "int64", "idf_weights": null, "vocabulary": null, "vocabulary_size": 3}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "integer_lookup", "inbound_nodes": [[["sex", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "IntegerLookup", "config": {"name": "integer_lookup_1", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "invert": false, "max_tokens": null, "num_oov_indices": 1, "oov_token": -1, "mask_token": null, "output_mode": "multi_hot", "sparse": false, "pad_to_max_tokens": false, "vocabulary_dtype": "int64", "idf_weights": null, "vocabulary": null, "vocabulary_size": 6}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "integer_lookup_1", "inbound_nodes": [[["cp", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "IntegerLookup", "config": {"name": "integer_lookup_2", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "invert": false, "max_tokens": null, "num_oov_indices": 1, "oov_token": -1, "mask_token": null, "output_mode": "multi_hot", "sparse": false, "pad_to_max_tokens": false, "vocabulary_dtype": "int64", "idf_weights": null, "vocabulary": null, "vocabulary_size": 3}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "integer_lookup_2", "inbound_nodes": [[["fbs", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "IntegerLookup", "config": {"name": "integer_lookup_3", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "invert": false, "max_tokens": null, "num_oov_indices": 1, "oov_token": -1, "mask_token": null, "output_mode": "multi_hot", "sparse": false, "pad_to_max_tokens": false, "vocabulary_dtype": "int64", "idf_weights": null, "vocabulary": null, "vocabulary_size": 4}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "integer_lookup_3", "inbound_nodes": [[["restecg", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "IntegerLookup", "config": {"name": "integer_lookup_4", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "invert": false, "max_tokens": null, "num_oov_indices": 1, "oov_token": -1, "mask_token": null, "output_mode": "multi_hot", "sparse": false, "pad_to_max_tokens": false, "vocabulary_dtype": "int64", "idf_weights": null, "vocabulary": null, "vocabulary_size": 3}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "integer_lookup_4", "inbound_nodes": [[["exang", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "normalization_5", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "axis": [-1], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "normalization_5", "inbound_nodes": [[["slope", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "IntegerLookup", "config": {"name": "integer_lookup_5", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "invert": false, "max_tokens": null, "num_oov_indices": 1, "oov_token": -1, "mask_token": null, "output_mode": "multi_hot", "sparse": false, "pad_to_max_tokens": false, "vocabulary_dtype": "int64", "idf_weights": null, "vocabulary": null, "vocabulary_size": 5}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "integer_lookup_5", "inbound_nodes": [[["ca", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "StringLookup", "config": {"name": "string_lookup", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "invert": false, "max_tokens": null, "num_oov_indices": 1, "oov_token": "[UNK]", "mask_token": null, "output_mode": "multi_hot", "sparse": false, "pad_to_max_tokens": false, "idf_weights": null, "vocabulary": null, "vocabulary_size": 6, "encoding": "utf-8"}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "string_lookup", "inbound_nodes": [[["thal", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "normalization", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "axis": [-1], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "normalization", "inbound_nodes": [[["age", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "normalization_1", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "axis": [-1], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "normalization_1", "inbound_nodes": [[["trestbps", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "normalization_2", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "axis": [-1], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "normalization_2", "inbound_nodes": [[["chol", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "normalization_3", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "axis": [-1], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "normalization_3", "inbound_nodes": [[["thalach", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "normalization_4", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "axis": [-1], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "normalization_4", "inbound_nodes": [[["oldpeak", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 3], [null, 6], [null, 3], [null, 4], [null, 3], [null, 1], [null, 5], [null, 6], [null, 1], [null, 1], [null, 1], [null, 1], [null, 1]]}, "name": "concatenate", "inbound_nodes": [[["integer_lookup", 0, 0, {}], ["integer_lookup_1", 0, 0, {}], ["integer_lookup_2", 0, 0, {}], ["integer_lookup_3", 0, 0, {}], ["integer_lookup_4", 0, 0, {}], ["normalization_5", 0, 0, {}], ["integer_lookup_5", 0, 0, {}], ["string_lookup", 0, 0, {}], ["normalization", 0, 0, {}], ["normalization_1", 0, 0, {}], ["normalization_2", 0, 0, {}], ["normalization_3", 0, 0, {}], ["normalization_4", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 36]}, "name": "dense", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}, "name": "dropout", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}, "name": "dense_1", "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "input_layers": [["sex", 0, 0], ["cp", 0, 0], ["fbs", 0, 0], ["restecg", 0, 0], ["exang", 0, 0], ["ca", 0, 0], ["thal", 0, 0], ["age", 0, 0], ["trestbps", 0, 0], ["chol", 0, 0], ["thalach", 0, 0], ["oldpeak", 0, 0], ["slope", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.13.1", "backend": "tensorflow"}